app/Modules/News/Controllers/Api/News.php

SELECT *
FROM `news`
WHERE `jenis_news` = '1'
ORDER BY `id` DESC
---
    public function news()
    {
        return $this->respond(['status' => true, 'message' => lang('App.getSuccess'), 'data' => $this->model->where('jenis_news', '1')->orderBy('id', 'DESC')->findAll()], 200);

SELECT *
FROM `news`
WHERE `jenis_news` = '2'
ORDER BY `id` DESC
 LIMIT 4
---
    public function info()
    {
        $limit = $this->setting->info['limit_info'];
        return $this->respond(['status' => true, 'message' => lang('App.getSuccess'), 'data' => $this->model->where('jenis_news', '2')->orderBy('id', 'DESC')->findAll($limit)], 200);