app/Modules/Cuaca/Controllers/Api/Cuaca.php

    public function display()
    {
        $api_key = env('OPENWEATHER_API_KEY');

        //get City
        $city = $this->setting->info['kota'];
        $cari = $this->model->find($city);
        $data1 = $cari['lokasi'];
        $pecah = explode(" ", $data1);
        $kota = ucfirst($pecah[1]);

        //get Provinsi
        $province = $this->setting->info['provinsi'];
        $cari = $this->provinsi->find($province);
---
SELECT *
FROM `kotas`
WHERE `kotas`.`id` = '1104'
SELECT *
FROM `provinsis`
WHERE `provinsis`.`id` = '11'