app/Modules/Setting/Controllers/Api/Setting.php

    public function general()
    {
        return $this->respond(["status" => true, "message" => "Success", "data" => $this->model->where('group_setting', 'general')->findAll()], 200);
---
SELECT *
FROM `settings`
WHERE `group_setting` = 'general'

    public function app()
    {
        return $this->respond(["status" => true, "message" => "Success", "data" => $this->model->where('group_setting', 'app')->findAll()], 200);
---
SELECT *
FROM `settings`
WHERE `group_setting` = 'app'

    public function kota()
    {
        return $this->respond(["status" => true, "message" => "Success", "data" => $this->kota->findAll()], 200);
---
SELECT *
FROM `kotas`

    public function provinsi()
    {
        return $this->respond(["status" => true, "message" => "Success", "data" => $this->provinsi->findAll()], 200);
---
SELECT *
FROM `provinsis`