app/Modules/Agenda/Controllers/Api/Agenda.php

    public function display()
    {
        $bulan = date("n");
        $limit = $this->setting->info['limit_agenda'];
        return $this->respond(['status' => true, 'message' => lang('App.getSuccess'), 'data' => $this->model->where('MONTH(tgl_agenda)', $bulan)->orderBy('tgl_agenda', 'DESC')->findAll($limit)], 200);
---
SELECT *
FROM `agendas`
WHERE MONTH(tgl_agenda) = '11'
ORDER BY `tgl_agenda` DESC
 LIMIT 4