app/Modules/Display/Controllers/Display.php

		}

		//Video Youtube
		$video = $this->video->where(['source' => 2, 'status' => 1])->orderBy('upload_time', 'DESC')->first();
---
SELECT *
FROM `videos`
WHERE `source` = 2
AND `status` = 1
ORDER BY `upload_time` DESC
 LIMIT 1